extends Node

const NORMAL_MODE = 1
const HARD_MODE = 2
const THREE_TASKS_MODE = 3

var currentGameMode = 0

var allEmojis = ["✌","😂","😝","😁","😱","👉","🙌","🍻","🔥","🌈","☀","🎈","🌹","💄","🎀","⚽","🎾","🏁","😡","👿","🐻","🐶","🐬","🐟","🍀","👀","🚗","🍎","💝","💙","👌","❤","😍","😉","😓","😳","💪","💩","🍸","🔑","💖","🌟","🎉","🌺","🎶","👠","🏈","⚾","🏆","👽","💀","🐵","🐮","🐩","🐎","💣","👃","👂","🍓","💘","💜","👊","💋","😘","😜","😵","🙏","👋","🚽","💃","💎","🚀","🌙","🎁","⛄","🌊","⛵","🏀","🎱","💰","👶","👸","🐰","🐷","🐍","🐫","🔫","👄","🚲","🍉","💛","💚"]
var selectedEmoji = null
var selectedEmojiPosition = null

var countEmoji = 0
var countNumber = 0

# Called when the node enters the scene tree for the first time.
func _ready():
	pass # Replace with function body.
